// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// Выполнить с помощью числовых операций (целочисленное деление, остаток от деления).

// 456 -> 5
// 782 -> 8
// 918 -> 1

Console.WriteLine("Введите любое трёхзначное число: ");
int number = Convert.ToInt32(Console.ReadLine());

if (number / 100 >= 1 && number / 100 < 10)
{ 
    Console.WriteLine($"Вторая цифра данного числа - это: {number / 10 % 10}");
}
else Console.WriteLine("Вы ввели не трёхзначное число, попробуйте снова");